bench/reproducible/results/20260523T123854Z-plaintext-final-k4/raw/actix-latency-plaintext-handler-round-1.txt
Running 15s test @ http://127.0.0.1:13003/plaintext-handler
  4 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   338.26us  689.89us  15.55ms   90.37%
    Req/Sec   178.41k    44.55k  231.59k    56.46%
  Latency Distribution
     50%   91.00us
     75%  178.00us
     90%    0.98ms
     99%    3.24ms
  10718525 requests in 15.10s, 1.15GB read
Requests/sec: 709835.81
Transfer/sec:     77.85MB